{
  "_class_name": "LensPipeline",
  "_diffusers_version": "0.37.1",
  "scheduler": [
    "diffusers",
    "FlowMatchEulerDiscreteScheduler"
  ],
  "vae": [
    "diffusers",
    "AutoencoderKLFlux2"
  ],
  "text_encoder": [
    "transformers",
    "LensGptOssEncoder"
  ],
  "tokenizer": [
    "transformers",
    "PreTrainedTokenizerFast"
  ],
  "transformer": [
    "diffusers",
    "LensTransformer2DModel"
  ]
}